#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```

terraform
data.aws_availability_zones.aws_azs: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0e1d0243d02de04e0]
data.aws_availability_zones.aws_azs: Read complete after 0s [id=eu-west-1]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-08a301e7900ff17ef]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-09db5785a6dfd071c]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0e39f2ae61401b1c4]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0a2558af275291418]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0e8fc1e1647b7df17]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0f096da4f7714fcf7]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-077f4e93189de9d4e]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-083ae407345a775e5]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-06f8c93e4a685e1ab]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0ac9304bc66da227f]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0a477dbbde07c0098]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-06f8c93e4a685e1ab1080289494]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0c2708099d9838709]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-06e0b862f487d38fd]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-08068361a78700ab1]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0a92982e3e98f3ad6]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-00d2d71fa8544ec8c]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0f096da4f7714fcf71080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.alb.aws_lb_target_group.main[0] will be created
  + resource "aws_lb_target_group" "main" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "django-ecs-tg"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "ManagedBy" = "Terraform"
          + "Name"      = "django-ecs-tg"
        }
      + tags_all                           = {
          + "ManagedBy" = "Terraform"
          + "Name"      = "django-ecs-tg"
        }
      + target_type                        = "instance"
      + vpc_id                             = "vpc-0e1d0243d02de04e0"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 5
          + interval            = 5
          + matcher             = "200"
          + path                = "/ping/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 2
          + unhealthy_threshold = 2
        }
    }

  # module.alb.aws_security_group.this[0] will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "django-elb-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "ManagedBy" = "Terraform"
          + "Name"      = "django-elb"
        }
      + tags_all               = {
          + "ManagedBy" = "Terraform"
          + "Name"      = "django-elb"
        }
      + vpc_id                 = "vpc-0e1d0243d02de04e0"
    }

  # module.alb_security_group.module.sg.aws_security_group.this_name_prefix[0] will be created
  + resource "aws_security_group" "this_name_prefix" {
      + arn                    = (known after apply)
      + description            = "security group to allow web traffic ingress to ALB listeners"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "alb-security-group-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "alb-security-group"
        }
      + tags_all               = {
          + "Name" = "alb-security-group"
        }
      + vpc_id                 = "vpc-0e1d0243d02de04e0"

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # module.alb_security_group.module.sg.aws_security_group_rule.egress_rules[0] will be created
  + resource "aws_security_group_rule" "egress_rules" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "All protocols"
      + from_port                = -1
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = -1
      + type                     = "egress"
    }

  # module.alb_security_group.module.sg.aws_security_group_rule.ingress_rules[0] will be created
  + resource "aws_security_group_rule" "ingress_rules" {
      + cidr_blocks              = [
          + "10.0.0.0/16",
        ]
      + description              = "HTTP"
      + from_port                = 80
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = []
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.alb_security_group.module.sg.aws_security_group_rule.ingress_rules[1] will be created
  + resource "aws_security_group_rule" "ingress_rules" {
      + cidr_blocks              = [
          + "10.0.0.0/16",
        ]
      + description              = "HTTP"
      + from_port                = 8080
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = []
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "ingress"
    }

  # module.alb_security_group.module.sg.aws_security_group_rule.ingress_rules[2] will be created
  + resource "aws_security_group_rule" "ingress_rules" {
      + cidr_blocks              = [
          + "10.0.0.0/16",
        ]
      + description              = "HTTPS"
      + from_port                = 443
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = []
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.alb_security_group.module.sg.aws_security_group_rule.ingress_rules[3] will be created
  + resource "aws_security_group_rule" "ingress_rules" {
      + cidr_blocks              = [
          + "10.0.0.0/16",
        ]
      + description              = "JMX"
      + from_port                = 1099
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = []
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 1099
      + type                     = "ingress"
    }

  # module.alb_security_group.module.sg.aws_security_group_rule.ingress_with_self[0] will be created
  + resource "aws_security_group_rule" "ingress_with_self" {
      + description              = "Ingress Rule"
      + from_port                = -1
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = -1
      + type                     = "ingress"
    }

Plan: 9 to add, 0 to change, 0 to destroy.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @phil-ward, Action: `pull_request`, Working Directory: ``, Workflow: `ci`*